Repository: oarepo/marshmallow-i18n-messages
Catalog: marshmallow_i18n_messages/translations/*/LC_MESSAGES/messages.po
Languages: cs

source: Not a valid {obj_type}.
cs: Neplatný typ objektu {obj_type}.

source: Not a valid {awareness} {obj_type}.
cs: Neplatná {awareness} {obj_type}.

source: "{input}" cannot be formatted as a {obj_type}.
cs: "{input}" nemůže být formátován jako typ {obj_type}.

source: Not a valid boolean.
cs: Není platná pravdivostní hodnota.

source: Missing data for required field.
cs: Chybí povinné pole.

source: Field may not be null.
cs: Pole nemůže být prázdné (null).

source: Invalid value.
cs: Chybná hodnota.

source: Not a valid date.
cs: Není platné datum.

source: "{input}" cannot be formatted as a date.
cs: Pole "{input}" nemůže být formátováno jako datum.

source: Special numeric values (nan or infinity) are not permitted.
cs: Speciální numerické hodnoty (jako nan - není číslo, nekonečno) nejsou povoleny.

source: Not a valid mapping type.
cs: Není platný typ mapování (dict a podobné).

source: Not a valid email address.
cs: Není platná email adresa.

source: Must be one of: {choices}.
cs: Musí být jedna z hodnot: {choices}.

source: Not a valid IP address.
cs: Není platná IP adresa.

source: Not a valid IP interface.
cs: Není platné IP rozhraní.

source: Not a valid IPv4 address.
cs: Není platná IPv4 adresa.

source: Not a valid IPv4 interface.
cs: Není platné IPv4 rozhraní.

source: Not a valid IPv6 address.
cs: Neplatná IPv6 adresa.

source: Not a valid IPv6 interface.
cs: Neplatné IPv6 rozhraní.

source: Not a valid integer.
cs: Musí být celé číslo.

source: Not a valid list.
cs: Musí být seznam hodnot.

source: Invalid type.
cs: Neplatný typ.

source: Not a valid number.
cs: Neplatné číslo.

source: Number too large.
cs: Číslo je příliš velké.

source: Not a valid string.
cs: Není hodnota typu řetězec.

source: Not a valid utf-8 string.
cs: Není platná utf-8 hodnota.

source: Not a valid period of time.
cs: Není platné časové období.

source: {input!r} cannot be formatted as a timedelta.
cs: {input!r} nemůže být formátováno jako časový přírůstek.

source: Not a valid tuple.
cs: Není platná hodnota typu Tuple.

source: Not a valid URL.
cs: Není platné URL.

source: Not a valid UUID.
cs: Není platné UUID.

source: One or more of the choices you made was in: {values}.
cs: Jedna nebo více hodnot z vašeho výběru byla z: {values}.

source: One or more of the choices you made was not in: {choices}.
cs: Jedna nebo více hodnot z vašeho výběru nebyla z: {choices}.

source: Must be equal to {other}.
cs: Hodnota musí být rovna "{other}".

source: Invalid input.
cs: Špatný vstup.

source: String does not match expected pattern.
cs: Řetězec nesleduje očekávaný vzor.

source: Not a valid dictionary.
cs: Není platným slovníkem.

source: Translation not found for
cs: Překlad nenalezen pro hodnotu

source: Only one identifier per scheme is allowed.
cs: Je povolen pouze jeden identifikátor per schema.

source: Please provide a valid date or interval.
cs: Prosím zadejte platný datum nebo interval dat.

source: No valid scheme recognized for identifier.
cs: Schéma pro identifikátor nebylo nalezeno.

source: Invalid {scheme} identifier.
cs: Špatné schéma identifikátoru: {scheme}.

source: Invalid scheme.
cs: Špatné schéma.

source: Shorter than minimum length {min}.
cs: Hodnota je kratší než minimální délka {min}.

source: Longer than maximum length {max}.
cs: Hodnota je delší než maximální délka {max}.

source: Length must be between {min} and {max}.
cs: Hodnota musí být mezi {min} a {max}.

source: Must be {min_op} {{min}}.
cs: Musí být {min_op} {{min}}.

source: Must be {max_op} {{max}}.
cs: Musí být {max_op} {{max}}.

source: Must be {min_op} {{min}} and {max_op} {{max}}.
cs: Musí být {min_op} {{min}} a {max_op} {{max}}.

source: greater than or equal to
cs: větší nebo rovno

source: greater than
cs: větší než

source: less than or equal to
cs: menší nebo rovno

source: less than
cs: menší než
